sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/jump_table.c
/// Not retained heap
#ifndef NON_RET_HEAP_SZ
    #define RWIP_HEAP_NON_RET_SIZE_JT       RWIP_HEAP_NON_RET_SIZE_USER // in bytes
#else
    #define RWIP_HEAP_NON_RET_SIZE_JT       NON_RET_HEAP_SZ             // in bytes
#endif

/// Env Heap
#ifndef ENV_HEAP_SZ
    #define RWIP_HEAP_ENV_SIZE_JT           RWIP_HEAP_ENV_SIZE_USER     // in bytes
#else
    #define RWIP_HEAP_ENV_SIZE_JT           ENV_HEAP_SZ                 // in bytes
#endif

/// DB Heap
#ifndef DB_HEAP_SZ
    #define RWIP_HEAP_DB_SIZE_JT            1024                        // in bytes
#else
    #define RWIP_HEAP_DB_SIZE_JT            DB_HEAP_SZ                  // in bytes
#endif

/// Msg Heap
#ifndef MSG_HEAP_SZ
    #define RWIP_HEAP_MSG_SIZE_JT           RWIP_HEAP_MSG_SIZE_USER     // in bytes
#else
    #define RWIP_HEAP_MSG_SIZE_JT           MSG_HEAP_SZ                 // in bytes
#endif

uint32_t rwip_heap_non_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_NON_RET_SIZE_JT)]   __SECTION_ZERO("heap_mem_area_not_ret");
uint32_t rwip_heap_env_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_ENV_SIZE_JT)]       __SECTION_ZERO("heap_env_area");
uint32_t rwip_heap_msg_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_MSG_SIZE_JT)]       __SECTION_ZERO("heap_msg_area");
uint32_t rwip_heap_db_ret[RWIP_CALC_HEAP_LEN(RWIP_HEAP_DB_SIZE_JT)]         __SECTION_ZERO("heap_db_area");


/*
 * ROM function table function definitions
 ****************************************************************************************
 */
void dummyf()
{
}

void crypto_init_func(void)
{
}

uint8_t ba431_get_rand_func(uint32_t id, uint8_t * dest, uint32_t byte_size)
{
    uint8_t i;
    for (i = 0; i < 32; i++)
        dest[i] = co_rand_byte();

   return 0;
}

int dia_rand_func(void)
{
#if (USE_CHACHA20_RAND)
    return csprng_get_next_uint32();
#else
    return rand();
#endif
}

void dia_srand_func(unsigned int seed)
{
#if (USE_CHACHA20_RAND)
    uint8_t temp[16];
    temp[0] = (seed >> 24) & 0xFF;
    temp[1] = (seed >> 16) & 0xFF;
    temp[2] = (seed >> 8) & 0xFF;
    temp[3] = seed & 0xFF;
    csprng_seed(temp);
#else
    srand(seed);
#endif
}

void dbg_init_func_empty(void);
void dbg_init_func_empty(void)
{
}

void dbg_platform_reset_complete_func_empty(uint32_t error);
void dbg_platform_reset_complete_func_empty(uint32_t error)
{
}

// The "smpm_ecdh_key_create_empty_func()" cannot be used in DA14531-01 or DA14535
#if !defined (__DA14531_01__) && !defined (__DA14535__)
#if (!ENABLE_SMP_SECURE)
void smpm_ecdh_key_create_empty_func(void)
{
}
#endif // ENABLE_SMP_SECURE
#endif // __DA14531_01__ or __DA14535__

void platform_reset_func(uint32_t error)
{
    uint16_t tmp;

#if (!PRODUCTION_TEST)
    // Trigger assert if the reset reason is other than RESET_AFTER_SUOTA_UPDATE
    ASSERT_WARNING(error == RESET_AFTER_SUOTA_UPDATE);
#endif
    // Trigger SW reset
    tmp = GetWord16(SYS_CTRL_REG);
    tmp = (tmp & ~REMAP_ADR0) | 0; // Map ROM at address 0
    tmp |= SW_RESET;
    SetWord16(SYS_CTRL_REG, tmp);
}


#if defined(CFG_UART_ONE_WIRE_SUPPORT)

void one_wire_uart_write_func(uint8_t *bufptr, uint32_t size, void (*callback) (uint8_t))
{
    uart_one_wire_tx_en(UART1);
    uart_write_func(bufptr, size,callback);
}

void one_wire_uart_h4tl_tx_done_func(uint8_t status)
{
    h4tl_tx_done_func(status);
    uart_one_wire_rx_en(UART1);
}

void one_wire_uart_gtl_eif_tx_done_func(uint8_t status)
{
    gtl_eif_tx_done_func(status);
    uart_one_wire_rx_en(UART1);
}

#endif // CFG_UART_ONE_WIRE_SUPPORT

#if defined (__DA14531_01__) || defined (__DA14535__)
#if (!ENABLE_SMP_SECURE)
#include "hci.h"
/**
 ****************************************************************************************
 * @brief Send dummy message to save power if legacy pairing is used in DA14531-01, DA14535.
 * @param[in] msg       Pointer to message
 ****************************************************************************************
 */
void llm_p256_start_dummy_func(struct ke_msg *msg)
{
    // allocate the event message
    struct hci_rd_p256_public_key_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_LE_EVENT, 0, HCI_LE_META_EVT_CODE, hci_rd_p256_public_key_cmd_cmp_evt);

    // fill event parameters
    event->subcode = HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_CMP_EVT_SUBCODE;
    event->status = CO_ERROR_NO_ERROR;
    // send the message
    hci_send_2_host(event);
}
#endif // ENABLE_SMP_SECURE
#endif // __DA14531_01__ or __DA14535__

#ifdef CFG_FSP_EXT_TASK
__USED ke_task_id_t _prf_get_id_from_task_func(ke_msg_id_t task)
{
    uint8_t idx = KE_IDX_GET(task);
    task = KE_TYPE_GET(task);
    
    if(task == TASK_FSP_EXT) {
        return KE_BUILD_ID(TASK_ID_FSP_EXT, idx);
    }

    return prf_get_id_from_task_func(task);
}

__USED ke_task_id_t _prf_get_task_from_id_func(ke_msg_id_t id)
{
    uint8_t idx = KE_IDX_GET(id);
    id = KE_TYPE_GET(id);

    if(id == TASK_ID_FSP_EXT) {
        return KE_BUILD_ID(TASK_FSP_EXT, idx);
    }
    
    return prf_get_task_from_id_func(id);
}
#endif // CFG_FSP_EXT_TASK

#if (!BLE_APP_PRESENT)

struct uart_txrxchannel
{
    /// size
    uint32_t  size;
    /// buffer pointer
    uint8_t  *bufptr;
    /// call back function pointer
    void (*callback) (uint8_t);
};

/// UART environment structure
struct uart_env_tag
{
    /// tx channel
    struct uart_txrxchannel tx;
    /// rx channel
    struct uart_txrxchannel rx;
    /// error detect
    uint8_t errordetect;
    //flow off retries
    uint32_t flow_off_retries;
    //flow off retries_limit
    uint32_t flow_off_retries_limit;
};

extern struct uart_env_tag uart_env;
static uint16_t flow_off_delay_us               __SECTION_ZERO("retention_mem_area0");

/**
 ****************************************************************************************
 * @brief Measure how much we should wait before going to sleep.
 * @note This depends on the baudrate selected we should wait minimum 1 character.
 ****************************************************************************************
 */
static void measure_flow_off_delay_us(void)
{
    SetBits16(&(UART1)->UART_LCR_REGF, UART_DLAB, UART_BIT_EN);
    flow_off_delay_us = 20*((GetWord8(&(UART1)->UART_IER_DLH_REGF) << 8) + GetWord8(&(UART1)->UART_RBR_THR_DLL_REGF)) + 2*uart_dlf_getf(UART1) + 2;
    SetBits16(&(UART1)->UART_LCR_REGF, UART_DLAB, UART_BIT_DIS);
}

/**
 ****************************************************************************************
 * @brief uart init function for external wake up flow control mechanism.
 * @note overrides the standard uart_init_func in the jump table.
 ****************************************************************************************
 */
void JT_uart_init_func(uint16_t baudr,uint8_t dlf_value, uint8_t mode )
{
    uart_init_func(baudr, dlf_value, mode);
    measure_flow_off_delay_us();
}

/**
 ****************************************************************************************
 * @brief uart flow off function for external wake up flow control mechanism.
 * @note overrides the standard uart_flow_off_func in the jump table.
 ****************************************************************************************
 */
bool _uart_flow_off_func(bool afce_en)
{
    volatile unsigned i;
    bool flow_off = true;

    do
    {
        if ((uart_tx_empty_getf(UART1) == 0) || (uart_thr_empty_getf(UART1) == 0))
        {
            if(uart_env.flow_off_retries_limit == 0 || (++uart_env.flow_off_retries < uart_env.flow_off_retries_limit))
            {
                flow_off = false;
                break;
            }
        }

