sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/jump_table.c
        uart_env.flow_off_retries = 0;

        SetWord32(UART_MCR_REG, afce_en ? UART_AFCE : 0);
 
        // Wait for 1 character duration to ensure host has not started a transmission at the
        // same time
        // default at 115200 delay
        arch_asm_delay_us(flow_off_delay_us);

        // Check if data has been received during wait time
        if(!(uart_data_ready_getf(UART1)==0))
        {
            // Re-enable UART flow
            //uart_flow_on();
            uart_flow_on_func();
            // We failed stopping the flow
            flow_off = false;
        }
    } while(false);

    return (flow_off);
}

/**
 ****************************************************************************************
 * @brief uart flow off function used when sleep is enabled.
 * @note overrides the standard uart_flow_off_func in the jump table.
 ****************************************************************************************
 */
static bool JT_uart_flow_off_func(void)
{
    return _uart_flow_off_func(false);
}

#endif

/*
 * ROM function table
 ****************************************************************************************
 */
const void * const rom_func_addr_table_var[] =
{
    (void *) rf_init_func,
    (void *) rf_reinit_func,
#if (!BLE_APP_PRESENT)
    (void *) JT_uart_init_func,
#else
    (void *) uart_init_func,
#endif
#if (UART_FLOW_CTRL_WAKEUP)
    (void *) ext_wakeup_uart_flow_on_func,
    (void *) ext_wakeup_uart_flow_off_func,
#elif (!BLE_APP_PRESENT)
    (void *) uart_flow_on_func,
    (void *) JT_uart_flow_off_func,
#else
    (void *) uart_flow_on_func,
    (void *) uart_flow_off_func,
#endif
    (void *) uart_finish_transfers_func,
    (void *) uart_read_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_write_func,
#elif (UART_FLOW_CTRL_WAKEUP) || (WKUP_EXT_PROCESSOR)
    (void *) ext_wakeup_uart_write_func,
#else
    (void *) uart_write_func,
#endif
#ifdef CFG_UART1_SDK
    (void *) UART_Handler_SDK_func,
#else
    (void *) UART_Handler_func,
#endif
    (void *) gtl_init_func,
    (void *) gtl_eif_init_func,
    (void *) gtl_eif_read_start_func,
    (void *) gtl_eif_read_hdr_func,
    (void *) gtl_eif_read_payl_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_gtl_eif_tx_done_func,
#else
    (void *) gtl_eif_tx_done_func,
#endif
    (void *) gtl_eif_rx_done_func,
    (void *) h4tl_init_func,
    (void *) h4tl_read_start_func,
    (void *) h4tl_read_hdr_func,
    (void *) h4tl_read_payl_func,
    (void *) h4tl_read_next_out_of_sync_func,
    (void *) h4tl_out_of_sync_func,
#if defined(CFG_UART_ONE_WIRE_SUPPORT)
    (void *) one_wire_uart_h4tl_tx_done_func,
#else
    (void *) h4tl_tx_done_func,
#endif
    (void *) h4tl_rx_done_func,
    (void *) ke_task_init_func,
    (void *) ke_timer_init_func,
    (void *) llm_encryption_done_func,
    (void *) nvds_get_func,
    (void *) nvds_put_func,
    (void *) nvds_del_func,
    (void *) nvds_init_func,
#if defined(CFG_USE_SPIHDDR)
    (void *) rwip_eif_get_func_spi,
#else
    (void *) rwip_eif_get_func,
#endif
    (void *) platform_reset_func,
    (void *)  lld_sleep_compensate_func,
    (void *)  lld_sleep_init_func,
    (void *)  lld_sleep_us_2_lpcycles_sel_func,
    (void *)  lld_sleep_lpcycles_2_us_sel_func,

    (void *) lld_test_stop_func,
    (void *) lld_test_mode_tx_func,
#if defined (__DA14531_01__) || defined (__DA14535__)
    (void *) lld_test_mode_rx_func,
#elif defined (__DA14531__)
    (void *) JT_lld_test_mode_rx_func,  // Rx window size set to 10ms in DA14531
#else
    (void *) lld_test_mode_rx_func,
#endif
    (void *) smpc_check_param_func,
#if USE_START_SMP_TIMEOUT_TIMER_UPON_TX_SEC_REQ_CMD  // Patch applies to DA14585/586 only
    (void *) JT_smpc_pdu_recv_func,
#else
    (void *) smpc_pdu_recv_func,
#endif

    (void *) prf_init_func,
    (void *) prf_add_profile_func,
    (void *) prf_create_func,
    (void *) prf_cleanup_func,
#ifdef CFG_FSP_EXT_TASK
    (void *) _prf_get_id_from_task_func,
    (void *) _prf_get_task_from_id_func,
#else
    (void *) prf_get_id_from_task_func,
    (void *) prf_get_task_from_id_func,
#endif

    (void *) NULL, //SetSystemVars_func,
#ifdef CFG_DBG_TASK
    (void *) dbg_init_func,
    (void *) dbg_platform_reset_complete_func,
#else
    (void *) dbg_init_func_empty,
    (void *) dbg_platform_reset_complete_func_empty,
#endif
    (void *) hci_rd_local_supp_feats_cmd_handler_func,

    (void *) l2cc_pdu_pack_func,
#if defined (__DA14531_01__) || defined (__DA14535__)
    (void *) l2cc_pdu_unpack_func,
#else
    (void *) JT_l2cc_pdu_unpack_func,
#endif
    (void *) l2c_send_lecb_message_func,
    (void *) l2c_process_sdu_func,
#if defined (__DA14531_01__) || defined (__DA14535__)
    (void *) l2cc_pdu_recv_ind_handler_func,
#else
    (void *) JT_l2cc_pdu_recv_ind_handler_func,
#endif
    (void *) gapc_lecb_connect_cfm_handler_func,
    (void *) atts_l2cc_pdu_recv_handler_func,
    (void *) attc_l2cc_pdu_recv_handler_func,

    (void *) crypto_init_func,
#ifndef __DA14531_01__
#ifdef __DA14535__
    (void *) JT_llm_le_adv_report_ind_func,
#else
    (void *) llm_le_adv_report_ind_func,                // No central support in DA14531-01
#endif
#endif
    (void *) PK_PointMult_func,
#if defined (CFG_HCI) && !defined (__DA14531__)
    (void *) JT_llm_p256_start_func,
#elif (!ENABLE_SMP_SECURE) && (defined (__DA14531_01__) || defined (__DA14535__))   // save power when legacy pairing is used (only for DA14531-01, DA14535)
    (void *) llm_p256_start_dummy_func,
#else
    (void *) llm_p256_start_func,
#endif
    (void *) llm_create_p256_key_func,
    (void *) llm_p256_req_handler_func,
#if defined (__DA14531__)
    (void *) llc_le_length_effective_func,
#else
    (void *) JT_llc_le_length_effective_func,
#endif
    (void *) llc_le_length_conn_init_func,
    (void *) lld_data_tx_prog_func,
    (void *) lld_data_tx_check_func,
    (void *) llc_pdu_send_func,
    (void *) NULL, //llc_data_notif_func,
    (void *) dia_rand_func,
    (void *) dia_srand_func,
    (void *) ba431_get_rand_func,
#if !defined (__DA14531__)        // Only for DA14585, DA14586
    (void *) &modulationGainCalibration_func,
    (void *) &DCoffsetCalibration_func,
    (void *) &PllLF_IFF_MIX_CapCalibration_func,
#endif
    (void *) smpc_public_key_exchange_start_func,
    (void *) smpc_dhkey_calc_ind_func,
/*
 * DA14531-01, DA14535 BLE stack behavior:
 *  The ECDH keys are always created after a pairing request, either legacy
 *  pairing or either secure connections has been selected.
 */
#if (ENABLE_SMP_SECURE) || (defined (__DA14531_01__) || defined (__DA14535__))
    (void *) smpm_ecdh_key_create_func,
#else
    (void *) smpm_ecdh_key_create_empty_func,
#endif // ENABLE_SMP_SECURE
#if defined (__DA14531__)
    (void *) ble_init_arp_func,
#endif
#if defined (__DA14535__)       // Only for DA14535AB silicon
    (void *) &llm_util_aa_gen_func,
#endif
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
};

// Extern variables used for accessing the SDK symbols in ROM
#if defined (__DA14531__)

