sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/jump_table.c
#if !defined (__EXCLUDE_ROM_NVDS__)
    extern rom_nvds_cfg_t rom_nvds_cfg;
#endif

#if (USE_CHACHA20_RAND) && !defined (__EXCLUDE_ROM_CHACHA20__)
    extern const rom_chacha20_cfg_t rom_chacha20_cfg;
#endif

#if (BLE_PROFILES) && !defined (__EXCLUDE_ROM_PRF__)
#include "prf.h"
    extern const rom_prf_cfg_t rom_prf_cfg;
#endif

#if (BLE_CUSTOM1_SERVER) && !defined (__EXCLUDE_ROM_CUSTS1__)
#include "custs1.h"
    extern const rom_cust_prf_cfg_t rom_cust_prf_cfg;
#endif

#if (BLE_APP_PRESENT) && !defined (__EXCLUDE_ROM_APP_TASK__)
#include "app_entry_point.h"
    extern const rom_app_task_cfg_t rom_app_task_cfg;
#endif

#if defined (CFG_PRINTF) && !defined (__EXCLUDE_ROM_ARCH_CONSOLE__)
#include "arch_console.h"
    extern const rom_console_cfg_t rom_console_cfg;
#endif

#endif
/*
 * ROM configuration table
 ****************************************************************************************
 */
const uint32_t rom_cfg_table_var[] =
{

    (uint32_t)TASK_GTL, //TASK_APP_SEC        // 0. app task          this entry is for the security app
#if defined ( __CC_ARM )
#pragma diag_suppress 1296
#endif
    (uint32_t)&rwip_heap_non_ret[0],          // 1. rwip_heap_non_ret_pos
    (uint32_t)RWIP_HEAP_NON_RET_SIZE_JT,      // 2. rwip_heap_non_ret_size
    (uint32_t)&rwip_heap_env_ret[0],          // 3. rwip_heap_env_pos
    (uint32_t)RWIP_HEAP_ENV_SIZE_JT,          // 4. rwip_heap_env_size
    (uint32_t)&rwip_heap_db_ret[0],           // 5. rwip_heap_db_pos
    (uint32_t)RWIP_HEAP_DB_SIZE_JT,           // 6. rwip_heap_db_size
    (uint32_t)&rwip_heap_msg_ret[0],          // 7. rwip_heap_msg_pos
    (uint32_t)RWIP_HEAP_MSG_SIZE_JT,          // 8. rwip_heap_msg_size
#if defined ( __CC_ARM )
#pragma diag_warning 1296
#endif
    MAX_SLEEP_DURATION_PERIODIC_WAKEUP,     // 9. max_sleep_duration_periodic_wakeup_pos  0x320
    MAX_SLEEP_DURATION_EXTERNAL_WAKEUP,     // 10.max_sleep_duration_external_wakeup_pos  0x3e80
    #if BLE_APP_PRESENT
    TASK_APP,                               // 11. app_main_task_pos
    #else // BLE_HOST_PRESENT
    TASK_GTL,                               // 11.
    #endif
    0x00D2,                                 // 12. man_id_pos Dialog Semi ManId

    50,     //13. max_tl_pending_packets_adv_pos
    60,     //14.  max_tl_pending_packets_pos
    1,      //15. ea_timer_prog_delay_pos
    1,      //16. ea_clock_corr_lat_pos
    2,      //17. ea_be_used_dft_pos
    2,      //18. start_margin_pos
    4,      //19. test_mode_margin_pos
    3,      //20.  bw_used_slave_dft_pos
    6,      //21.  bw_used_adv_dft_pos
#ifdef XTAL_32000HZ
    1,      //22. hz32000_pos
#else
    0,      //22. hz32000_pos
#endif
    2,      //23. rwble_prog_latency_dft_pos
    2,      //24. rwble_asap_latency_pos               24
    0,      // rwble_priority_adv_ldc_pos              25
    0,      // rwble_priority_scan_pos                 26
    3,      // rwble_priority_mconnect_pos             27
    3,      // rwble_priority_sconnect_pos             28
    5,      // rwble_priority_adv_hdc_pos              29
    5,      // rwble_priority_init_pos                 30
    6,      // rwble_priority_max_pos                  31
    10,     //gap_lecb_cnx_max
    10,     //gapm_scan_filter_size
    200,    //smpc_rep_attempts_timer_def_val
    3000,   //smpc_rep_attempts_timer_max_val
    2,      //smpc_rep_attempts_timer_mult
    3000,   //smpc_timeout_timer_duration
    0x0BB8, //att_trans_rtx
    0x10,   //att_sec_enc_key_size
    468,    //wakeup_boundary_var
#if defined (__DA14531__)
    460,    //lld_evt_abort_cnt_duration
#else
    485,    //lld_evt_abort_cnt_duration
#endif
    624,    //ea_check_halfslot_boundary
    106,    //ea_check_slot_boundary
    (BLE_RX_BUFFER_CNT/2),      //RX interrupt threshold
    BLE_CONNECTION_MAX_USER,    //nb_links_user
    LLM_ADV_INTERVAL_MIN,       //llm_adv_interval_min_noncon_disc_pos
#if defined (__DA14535__)
    12,     //sw_version_major_pos (v5.3)
#elif defined (__DA14531__)
    10,     //sw_version_major_pos (v5.1)
#endif
#if defined (__DA14531__)
    1,      //sw_version_minor_pos
    1250,   //adv_int_conn_dir_pos
    650,    //adv_int_nonconn_undir_pos
    1500,   //adv_int_con_dir_ldc_pos
#if (__FPGA__)
    250,
#else
#if (RADIO_ANALOG)
    272,
#else
    175,    //prefetch_time_pos
#endif
#endif
#endif // __DA14531__
/*
 * Support for SDK symbols in ROM (only for DA14531)
 */
#if defined ( __CC_ARM )
#pragma diag_suppress 1296
#endif
#if defined (__DA14531__)
#if !defined (__EXCLUDE_ROM_NVDS__)
    (uint32_t) &rom_nvds_cfg,                // nvds_config_pos
#else
    (uint32_t) NULL,
#endif

#if (USE_CHACHA20_RAND) && !defined (__EXCLUDE_ROM_CHACHA20__)
    (uint32_t) &rom_chacha20_cfg,            // chacha_config_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_CUSTOM1_SERVER) && !defined (__EXCLUDE_ROM_CUSTS1__)
    (uint32_t) &rom_cust_prf_cfg,            // custs1_prf_conf_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_PROFILES) && !defined (__EXCLUDE_ROM_PRF__)
    (uint32_t) &rom_prf_cfg,                 // prfconf_config_pos
#else
    (uint32_t) NULL,
#endif

#if (BLE_APP_PRESENT) && !defined (__EXCLUDE_ROM_APP_TASK__)
    (uint32_t) &rom_app_task_cfg,            // appconf_config_pos
#else
    (uint32_t) NULL,
#endif

#if defined (CFG_PRINTF) && !defined (__EXCLUDE_ROM_ARCH_CONSOLE__)
    (uint32_t) &rom_console_cfg,            // console_config_pos
#else
    (uint32_t) NULL,
#endif

#if defined (__DA14535__)
    (uint32_t) NULL,
    (uint32_t) NULL,
    350,                                    // uart_char_delay_iterations_pos
#endif

#endif
# if defined ( __CC_ARM )
#  pragma diag_warning 1296
# endif
};
